src/main/resources/final.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<GenerateDomesticTravelCertificate
			xmlns="http://starhealth.in/">
			<oDomesticTravelCertificate>
				<COI_Num_Gen>string</COI_Num_Gen>
				<ProductCode>string</ProductCode>
				<PolOpenPolNo>string</PolOpenPolNo>
				<PolFmDt>string</PolFmDt>
				<PolToDt>string</PolToDt>
				<Plan>string</Plan>
				<Period>string</Period>
				<FFCode>string</FFCode>
				<DivnCode>string</DivnCode>
				<BankCode>string</BankCode>
				<BankBranchCode>string</BankBranchCode>
				<SPCode>string</SPCode>
				<CorpEmpId>string</CorpEmpId>
				<Scheme>string</Scheme>
				<ReferenceNo1>string</ReferenceNo1>
				<ReferenceNo2>string</ReferenceNo2>
				<ReferenceNo3>string</ReferenceNo3>
				<Air_YN>string</Air_YN>
				<Road_YN>string</Road_YN>
				<Rail_YN>string</Rail_YN>
				<PrivateCar_YN>string</PrivateCar_YN>
				<LegalHeir>string</LegalHeir>
				<DomesticInsuredDetails>
					<TravelInsuredDetail>
						<Name>string</Name>
						<Gender>string</Gender>
						<Relation>string</Relation>
						<DateOfBirth>string</DateOfBirth>
						<AgeinYrs>string</AgeinYrs>
						<AgeinMths>string</AgeinMths>
						<SumInsured>string</SumInsured>
						<OriginPlace>string</OriginPlace>
						<DestinationPlace>string</DestinationPlace>
						<MailId>string</MailId>
						<MobileNo>string</MobileNo>
						<Address>string</Address>
						<State>string</State>
						<Pincode>string</Pincode>
						<City>string</City>
						<HeartDisease>string</HeartDisease>
						<Stroke>string</Stroke>
					</TravelInsuredDetail>
					<TravelInsuredDetail>
						<Name>string</Name>
						<Gender>string</Gender>
						<Relation>string</Relation>
						<DateOfBirth>string</DateOfBirth>
						<AgeinYrs>string</AgeinYrs>
						<AgeinMths>string</AgeinMths>
						<SumInsured>string</SumInsured>
						<OriginPlace>string</OriginPlace>
						<DestinationPlace>string</DestinationPlace>
						<MailId>string</MailId>
						<MobileNo>string</MobileNo>
						<Address>string</Address>
						<State>string</State>
						<Pincode>string</Pincode>
						<City>string</City>
						<HeartDisease>string</HeartDisease>
						<Stroke>string</Stroke>
					</TravelInsuredDetail>
				</DomesticInsuredDetails>
				<DomesticNomineeDetails>
					<TravelNomineeDetail>
						<NomineeName>string</NomineeName>
						<NomineeAge>string</NomineeAge>
						<NomineeDOB>string</NomineeDOB>
						<NomineePercentage>string</NomineePercentage>
						<NomineeRelationship>string</NomineeRelationship>
						<AppointeeName>string</AppointeeName>
						<AppointeeAge>string</AppointeeAge>
						<AppointeeRelationship>string</AppointeeRelationship>
					</TravelNomineeDetail>
					<TravelNomineeDetail>
						<NomineeName>string</NomineeName>
						<NomineeAge>string</NomineeAge>
						<NomineeDOB>string</NomineeDOB>
						<NomineePercentage>string</NomineePercentage>
						<NomineeRelationship>string</NomineeRelationship>
						<AppointeeName>string</AppointeeName>
						<AppointeeAge>string</AppointeeAge>
						<AppointeeRelationship>string</AppointeeRelationship>
					</TravelNomineeDetail>
				</DomesticNomineeDetails>
				<COIPremiumDetails>
					<Receipt_Type>string</Receipt_Type>
					<COINo>string</COINo>
					<Premium>string</Premium>
					<IGST>string</IGST>
					<CGST>string</CGST>
					<SGST>string</SGST>
					<COIDocLink>string</COIDocLink>
				</COIPremiumDetails>
			</oDomesticTravelCertificate>
		</GenerateDomesticTravelCertificate>
	</soap:Body>
</soap:Envelope>

